{
    "description": "Recruited into the KGB at an early age and trained in the Red Room, Natasha Alianovna Romanoff developed into one of the world’s greatest and most ruthless assassins. After drawing the attention of Nick Fury, she was recruited to join S.H.I.E.L.D. at Clint Barton’s recommendation, even going on to become a founding member of The Avengers. Following the events of The Avengers Civil War, Romanoff is forced to confront the darkness of her past in the Red Room and the possibility of future generations of Black Widow assassins.",
    "gameplay": {
        "description": "Passive:\n- Baton Hits deal Energy Damage instead of Physical and have a 40% chance to inflict a Shock Debuff dealing 1827.75 Energy Damage for 3.65 seconds.\n\n\nWidow’s Insight – Max 50 Stacks:\n- Black Widow’s covert assassin training kicks in whenever the perfect opportunity to strike presents itself. Gain Widow’s Insight for 0.85 seconds whenever the Opponent is dashing forward or recovering from a Heavy, Special, or Combo ending Attack.\n- This ability refreshes its duration when successfully landing hits.\n- Widow’s Insight is not affected by Ability Accuracy.\n\n\nWhile Widow’s Insight is Active:\n- Light Hits: Increase Shock Ability Accuracy by a flat 60%.\n- Medium Hits: Reduce Defensive Ability Accuracy by 70%.\n- Heavy Hits: 100% chance to inflict a Stun Debuff for 1.75 seconds.\n- Ending a Combo has 100% chance to grant a Precision Buff increasing Critical Rating by 286.36 for 24 seconds. Max 8 Stacks.\n\n\nCounter-Attack Evade\n- When caused to Miss, gain a Passive Evade granting 100% chance to Evade the next Basic Attack for 8 seconds. After triggering an Evade this effect is removed. Evade does not trigger while holding Block.\n- When triggering an Evade, Black Widow Counter-Attacks with a Flashbang. This attack cannot Miss and does not generate Power.\n- When triggering an Evade through any of Black Widow’s personal Evade abilities, inflict a Sabotage Debuff reducing Defensive Ability Accuracy by 20% for 6 seconds. Sabotage deals 48.74 Direct Damage whenever an Opponent’s Defensive Abilities fail to trigger."
    },
    "specials": {
        "1": {
            "description": "Flight of the Arachnid – Black Widow strikes with a full turn kick and baton combo before delivering a shocking surprise.\n\n- The last hit inflicts a Shock Debuff dealing 2437 Energy Damage over 13 seconds.\n- At the end of this Special Attack gain a Passive Evade granting 100% chance to Evade any Basic Attack for 6 seconds. After triggering this Evade the effect is removed. Evade will not trigger while Blocking."
        },
        "2": {
            "description": "Spider Bite Combination – Black Widow displays her graceful baton work in a flurry of electrifying strikes.\n\n- Deal 4630.3 as a burst of Shock Damage when striking Shocked Opponents.\n- If Widow’s Insight is active: All hits reduce Defensive Ability Accuracy by 70%.",
            "note": "Players will have to activate their Special Attacks immediately after finishing their combos to fully make use of this attack. The damage of this attack can be enhanced further if the opponent is suffering from a Sabotage Debuff and has a Defensive Ability that triggers when Struck."
        },
        "3": {
            "description": "Dance of the Elusive Black Widow – Black Widow  forms her batons into electrified whips before she gracefully loads her opponent with voltage.\n\n- Inflict a Sabotage Debuff reducing Defensive Ability Accuracy by 20% for 16 seconds and dealing 48.74 Direct damage when the Opponent’s Defensive Abilities fail to trigger.\n- For every 5 stacks of Widow’s Insight gained since last activating this Special Attack, create a Passive Cruelty increasing Critical Damage Rating by 430.12 for 30 seconds. Widow’s Insight is reset to 0 after launching this Special Attack.",
            "note": "The Critical Damage Rating boost on this attack is better utilized in longer fights as building up stacks of Widow’s Insight will also gradually build up your chance to deal Critical hits through Precision Buffs. This combination should greatly increase your damage output."
        }
    },
    "signature": {
        "description": "Red Room Training  \nPassive\n- Increase the potency of Sabotage Debuffs, increasing Direct damage done when abilities fail to trigger by 120%.\n- Increase the duration of Sabotage Debuffs by 80%.\n- Landing hits while Widow’s Insight is active pauses Sabotage Debuffs for 0.50 seconds.",
        "note": "Sabotage will also trigger when certain Quest Buffs (Adaptive, Soft Guard, etc.) are present allowing Black Widow to output even more damage versus these Defensive buffs."
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "https://playcontestofchampions.com/champion-spotlight-black-widow-deadly-origin/"
    },
    "youtube":"KOr-JxyWITk"
}
