{
    "description": "Claire Voyant was a spirit medium who communicated with the dead through supernatural means. Killed by a client in a job gone wrong, Voyant is sent to Hell where Satan gives her the ability to kill with a single touch, sending her back to Earth to avenge her own death. After avenging her murder, Voyant returns to Satan who, no longer content to wait for evil souls to die a natural death, charges her with bringing more souls to him.",
    "youtube": "sMaJfda9IuE",
    "gameplay": {
        "description": "Clairvoyance Charge – Passive \n- Claire starts with 3 charges. Each time she or her Opponent are immune to any effect, or an immunity Purifies a pre-existing effect, she gains 1 charge and 4% of her max Power. Charges stack up to 20.\n- After landing or receiving a Light or Medium attack and the Opponent has 1 or more Buffs, a charge is consumed and 1 Buff is Nullified.\n\n\nCurse of the Black Widow\n- Claire has 3 types of curses, each providing her with a different immunity, however, only 1 curse can be active at a time.\n- By default the Curse of Blood is active. Landing a fourth Light Attack casts the next curse in the following order:\n- Curse of Blood: Bleed immunity.\n- Curse of Plague: Poison immunity.\n- Curse of Hellfire: Incinerate immunity."
    },
    "specials": {
        "1": {
            "description": "Curse of Damnation: Summoning a blast from the underworld, Claire curses her Opponent.  \n- Finishing a combo with a Medium attack inflicts 1 Debuff. Throwing a Heavy Attack or Special 1 inflicts up to 3 Debuffs. These Debuffs are determined by Claire’s active curse and last for 8 seconds.\n- Curse of Blood: Bleed, dealing 57.64 direct damage.\n- Curse of Plague: Poison, dealing 57.64 damage and reducing health recovery by 30%.\n- Curse of Hellfire: Incinerate, dealing 57.64 damage, removing Perfect Block Chance and reducing Block Proficiency by 50%.",
            "note": "If the Opponent is throwing a Special Attack that lasts for a long duration and doesn’t cover the whole screen, Claire can dash back and throw Heavy Attacks during their attack to cast Debuffs onto them safely. It’s important to keep an eye on the Opponent since they will likely dash right back in after their attack ends, but this can be a quick trick to build Debuffs or charges."
        },
        "2": {
            "description": "Wrath of the Widow: Leaping forward, Claire uses her shadow limbs to slash the Opponent with a series of devastating blows.\n\n- 100% chance to inflict the Opponent with Buff Immunity for 10 seconds. Decreasing to 50% against Science Champions.\n- Each hit grants an effect determined by Claire’s active curse.\n- Curse of Blood: Regenerate 35% of the damage dealt.\n- Curse of Plague: Steal 5% of the Opponent’s current Power.\n- Curse of Hellfire: Deal a burst of 1152.8 direct energy damage.",
            "note": "By using some smart timing, it’s possible for Claire to throw a Special 2 while Curse of Plague is active and steal back enough power to immediately throw another special. Balancing the different curses, depending on the matchup, is key to playing as Claire."
        },
        "3": {
            "description": "Soul Reaver: Claire seals the Opponent’s fate marking their forehead with the touch of death and sentencing their soul to Hell.\n\n- All Clairvoyance charges are removed, each increasing her Attack Rating during this attack by 288.2.\n- Claire gains Death Touch, lasting for 1.2 seconds per Clairvoyance charge removed, Death Touch increases the Potency of all Curse effects by 100% and is not affected by Ability Accuracy reduction."
        }
    },
    "signature": {
        "description": "Death Immunity while Death Touch is Active\n\n- When receiving damage that would knock her out, Death Touch is consumed instead and Claire gains a Death Immunity Buff, preventing death and healing 18.83% of her max health over 4 seconds.",
        "note": "f Claire is awakened, Death Touch is a great way to survive incoming Special 3 Attacks or other high damaging unavoidable attacks. Additionally any hit that would kill Claire while Death Touch is active will grant her a Clairvoyance charge since she is immune to it."
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "https://playcontestofchampions.com/champion-spotlight-black-widow-claire-voyant/"
    }
}