{
    "youtube": "PI4u8avT1jA",
    "description": "After crash landing on Earth without any memory of her past, Air Force pilot, Carol Danvers slowly uncovers the events of her past. Rescued by the Kree and reborn as a noble Kree warrior, Carol learns to control her new powers under the guidance of Mar-Vell, commander of the Starforce. When she finds herself on Earth again Carol Danvers becomes one of the universe’s most powerful heroes when the Earth is caught in the middle of a galactic war between two alien races.",
    "gameplay": {
        "description": "PASSIVE\n- Advanced Kree physiology provides full immunity to the Poisons of the Battlerealm.\n\n\nSUPER STRENGTH \n- Landing a hit or hitting into a Block with a Light or Medium Attack has a 15% chance to inflict Armor Break reducing Armor Rating by 439.02 for 7 seconds. \n- Intercepting an opponent's Dash Attack has a 100% chance to inflict Armor Break reducing Armor Rating by 439.02 for 7 seconds.\n- Striking with a Heavy Attack while the opponent is charging or executing a Heavy Attack removes all Armor Up effects and inflicts Stun for 2.5 seconds.  \n\n\nENERGY ABSORPTION\n- Captain Marvel gains Persistent Energy Charges by Blocking Physical Attacks and when Struck by Energy Attacks. Any Energy Charges that Captain Marvel ends a fight with persists between fights. Max 25 stacks.\n- Well Timed Blocks generate an additional Energy Charge.\n- At the start of the fight, Captain Marvel gains 2% of Max Power for each Energy Charge she has.\n- Captain Marvel suffers 251.43 damage when Energy Charges are generated by the effects of Mystic Champions.\n\n\nBINARY IGNITION\n- While at or over 10 Energy Charges, Dashing back and holding Block for 1.2 seconds or being Knocked Down Purifies all Debuffs and pushes Captain Marvel into Binary Ignition. Captain Marvel enters Binary Ignition automatically at 25 Energy Charges.\n- In Binary Ignition, Captain Marvel does not generate Energy Charges and each Charge lasts 1.2 seconds.\n- Gain a Permanent Fury Buff increasing Attack by 344.4 for every 5 stacks of Energy Charge. All Fury Buffs are removed when Energy Charges fall to zero.\n- Damaging Energy Debuffs increase the duration of Energy Charges by 1 second.\n- The chance to inflict Armor Break with a Light or Medium Attack increases to 60%.\n- Deal an additional 30% of damage dealt as a burst of Energy Damage when striking an opponent with an Armor Break Debuff.\n- Landing Heavy Attacks while in Binary Ignition generate 3 Energy Charges."
    },
    "specials": {
        "1": {
            "description": "\"Photon\" Blast - Tearing through the toughest defenses, Captain Marvel unleashes two powerful beams of cosmic energy before leaping in for an Earth shaking punch.",
            "note": "Generate 3 Energy Charges. Energy Beams in this attack deal True Damage. In Binary Ignition, Beam Attacks are Unblockable but this attack expends 2 Energy Charges instead."
        },
        "2": {
            "description": "Skrull Slayer - With a graceful flurry of powerful kicks and punches, Captain Marvel sends her foes back with a pair of well-placed cosmic beams.",
            "note": "100% chance to Stun for 2 seconds. In Binary Ignition this stun lasts 3.5 seconds. Energy Beams in this attack deal True Damage. In Binary Ignition, Beam Attacks are Unblockable and expend 4 Energy Charges."
        },
        "3": {
            "description": "Space-faring Binary Star - Harnessing the power of a Binary Star, Captain Marvel sends her foes into orbit before burying them in cosmic energy.",
            "note": "Generate 10 Energy Charges. Gain a Power Gain Buff generating 40% of max Power over 10 seconds."
        }
    },
    "signature": {
        "description": "Binary Durability - Above 20 Energy Charges\n- While Binary Ignition is active Captain Marvel gains an Indestructible Buff for 12 seconds.\n- This ability can be activated again after a 40 second cooldown.\n- The Indestructible Buff and half of Captain Marvel's Energy Charges are removed when struck by a Special Attack.",
        "note": "With this signature ability, Captain Marvel is able to withstand the most powerful attacks if players opt to wait and build over 20 Energy Charges and activate Binary Ignition at just the right moment."
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "https://forums.playcontestofchampions.com/en/discussion/125504/champion-spotlight-captain-marvel/"
    }
}