{
    "description": "Alexander Summers aka Havok, is the younger brother of Scott Summers. Much like his brother Havok has the ability to project blasts of plasma energy, though his blasts are released as concentric waves of energy, and Havok must use significant effort to focus them into directed blasts. Havok can be overwhelmed by his power which can make him nearly as dangerous to his friends as his enemies, and leads him to wear a specialized containment suit.",
    "gameplay": {
        "description": "Passive \nHavok is Immune to all forms of Incinerate.\nHavok’s mutation gives him +2000 Energy Resistance\nHavok Passively generates 2.5% of a Bar of Power each second\nHavok gains 25% less Power from landing and receiving Hits.\nDeveloper Note: High Energy Resistance and Incinerate Immunity are generally useful. The slow natural Power Gain is compensated for by the reduced Power from Hits, this works for a Havok who’s able to stay in control of a fight, but can push an unwary Havok to the next Special whether they want to build that Power or not.\n\nWhen Struck by Critical Hits \nHavok reduces his Opponent’s Critical Damage Rating by 50%.\nDeveloper Note: Note this is recalculated and applied on each hit, meaning it will account for changes in your Opponent’s Critical Damage Rating over the course of the fight (Buffs etc). Also remember this is modifying Critical Damage Rating, not just dividing the Damage value in half.\n\n\nPlasma Charges – Passive \nHavok generates a Plasma Charge every 5 seconds, and can have a maximum of 10 Plasma Charges.\nWhile Power Locked Havok’s Plasma Charge generation increases to 2 Charges every 5 seconds.\nEach time Havok receives Energy Damage or a Critical Hit he gains +1 Plasma Charge(s).\nIf affected by a Power Drain Havok loses all his Plasma Charges.\nDeveloper Note: This is the resource that Havok has the most control over. Use Special 1 to build it up quickly, and Heavy Attacks to help keep it from overflowing into Plasma Build Ups causing them to detonate before you’re ready. It’s also worth noting that any Power Drain clears all of Havok’s Plasma Charges, regardless of how big or small the Drain is, and yes Power Steals count too.\n\nPlasma Build Up – Debuff \nWhen Havok would generate a Plasma Charge beyond his maximum, he instead places a Plasma Build Up on the Opponent. Plasma Build Ups last until removed by another ability.\nIf made to Bleed Havok puts a Plasma Build Up on the Opponent.\nAt 11 Stacks all Plasma Build Ups are Removed.\nWhen a Plasma Buildup is removed, it detonates causing 168 Energy Damage.\nIf a Plasma Build Up is removed due to a Purify effect its Damage is increased to 448.\nChampions with an Armor Up Buff, and Havok, receive no damage from this ability.\nDeveloper Note: This is the second half of Havok’s burst Damage Combo, use Havok’s Heavy attack to control how many Build Ups get placed on the Opponent, and try to keep them from detonating while the Opponent is protected by an Armor Up Buff, as that will burn the charges without causing any damage.\n\nWhile Heavy Attack Charging \nConvert 2 Plasma Charge(s) to 1 Prowess, each increasing Special Attack Damage by 10% and lasting until Havok’s next Special Attack ends. Max 5 stacks.\nDeveloper Note: Exchange 2 Plasma Charges for 1 Prowess! Keep in mind this conversion happens as soon as Havok enters the Heavy Animation, no need to actually land a hit, though it only happens once per Heavy, no holding this to drain all the Charges. Also worth noting that the Max 5 Stacks applies only to the Prowess Effects from this ability, using Specials will allow you to stack as many as you can trigger before their Durations expire.  \n\n\nSpecial Attacks \nIf Havok has 7+ Stacks of Prowess all hits of his Special Attacks become Unblockable.\nConverts up to 5 Plasma Charge(s) into Passive Prowess Effects, each increasing Special Attack Damage by 10% and lasting for 13 seconds.\nDeveloper Note: At 7+ Prowess ALL the hits of Havok’s Special Attacks go Unblockable."
    },
    "specials": {
        "1": {
            "description": "Blast Waves – Havok releases waves of raw plasma energy, to batter his foes while building up dangerous levels of residual energy in their very cells.",
            "note": "On activating this Special Attack Havok gains an Overcharge Passive Effect for the next 9 seconds, granting +1 Plasma Charge(s) per second. Developer Note: Overcharge is how Havok can build lots of Plasma Charges quickly (especially once his Signature Ability gets ramped up!). He can gain so many Charges from this, you will likely need to use his Heavy Attack to convert some Charges into Prowess to prevent the Build Ups from Detonating prematurely."
        },
        "2": {
            "description": "Focused Blast – Havok harnesses the energy within himself, propelling into the air before releasing a blast of plasma channeled directly towards his opponent.",
            "note": "+1960 Attack as long as the Opponent doesn’t have an active Armor Up Buff. Developer Note: Nice and simple, Bonus Attack if the Opponent doesn’t have Armor Up Buffs. While the SP3 can do more damage in a single big blast, this attack doesn’t care how many Plasma Build Ups you can manage to keep on the Opponent making it more effective against Debuff Immune Opponents, or if you don’t want to remove the Build Ups for some reason, maybe for that Plasma Feedback Damage from your Heavy attack?"
        },
        "3": {
            "description": "Overwhelming Power – Nearly losing control Havok burns bright enough to compete with the very stars, before unleashing a devastating series of plasma blasts!",
            "note": "Convert all Plasma Charges into Prowess Passive Effects. +448 Attack for each Plasma Charge converted. Purifies all Plasma Build Ups on the Opponent.\nDeveloper Note: This is where Havok can do a bunch of damage with the push of a button, assuming he’s been setup. Keep in mind that since the Plasma Build Up damage on Purify scales with Attack, the Attack bonus for Plasma Charge conversion here gets applied to both the Prowess enhanced special attack damage, and the Plasma Build Up Purify damage."
        }
    },
    "signature": {
        "description": "Plasma Amplification – Passive\n\nHavok’s powers have massive potential, but their tendency to surge suddenly threatens to overwhelm his control.\n\nEach time Havok gains a Plasma Charge, from any source other than this ability he has a 50% chance to gain another one.",
        "note": "This ability allows Havok to charge through his rotation and get setup for another big Special attack MUCH faster, however as Havok is famous for, this can make his powers a little unpredictable, and harder to control."
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "https://playcontestofchampions.com/champion-spotlight-havok/"
    },
    "youtube": "CghRGx0kvWE",
    "attack": {
        "heavy": "Places a Plasma Feedback Debuff on the Opponent for 10 seconds, causing 56 Energy Damage over its duration, for each Plasma Build Up on the Opponent. Developer Note: This is how Havok can do damage without spending his Plasma Build Ups, as well as get some bonus damage while you’re waiting for your Plasma Charges to reach critical mass again.",
        "description": "All Attacks \nHavok’s Medium Attacks, Heavy Attacks, and Light combo ending attacks do not make Contact, and deal Energy Damage.\nDeveloper Note: Havok’s Medium 1 Attack doesn’t make Contact, so be careful not just to muscle memory an attack back at him thinking your Parry will have stunned him out of his dash."
    }
}