{
    "description": "Ah ah, ook oooh ah ah. Ook eek ah ooooh, oh ah eek eeeeek. Ook ah. Ah ooh ooh, ah ooh ahh ah. Eek eeeeek! Eek ooh, oooooooh ah ahhh. Ook oh, ah ah ooh. Aaack ahhh, eek eek oh! Oh oh, ahh oh ah.\n\nGwenpool here! It’s a good thing I speak Macaque! This dapper little guy was just an ordinary monkey, until his tribe gave sanctuary to an on-the-run assassin. Mercenaries came and killed both the assassin, and the rest of Hit-Monkey’s tribe! So Hit-Monkey took up the fallen assassin’s weapons and swore vengeance against both those responsible, and all others who call themselves mercenaries.",
    "gameplay": {
        "description": "Nunchaku  \n- Hit-Monkey’s nunchaku attacks are guaranteed Critical Hits against Opponents who are not Blocking. He uses them for his first Medium Hit, first Light Hit, and second Medium Hit.\n- Landing 3 Critical Hits in a row deals internal damage to the Opponent and inflicts a Bleed Debuff, dealing +1263.5 Direct Damage over 4.5 second(s).\n\n\nMonkey Scheme, Monkey Do\n- Landing 3 Critical Hits in a row grants Hit-Monkey a Monkey Scheme. This is unaffected by Ability Accuracy.\n- Blocking or Dodging an attack converts a Monkey Scheme into Assassin’s Cunning, lasting 8 second(s).\n- Attacking or being Struck converts a Monkey Scheme into Primal Rage, lasting 8 second(s).\n- Against #Mercenary Opponents, Monkey Schemes are always converted into both Assassin’s Cunning and Primal Rage.\n- While Assassin’s Cunning or Primal Rage are active, Monkey Schemes cannot be gained.\n\n\nWhen Knocked Down\n- Activate both Assassin’s Cunning and Primal Rage for 6 second(s).\n\n\nOn Opponent Evade\n- Activate Assassin’s Cunning and refresh Primal Rage. This is unaffected by Ability Accuracy, but can’t trigger more than once every 15 second(s).\n\n\nAssassin’s Cunning – Passive\n- Prevent the Opponent’s Evade effects.\n- Gain a 60% chance to Evade an incoming Basic Attack while not Blocking. Evading removes Assassin’s Cunning.\n- The Bleed Debuffs from Hit-Monkey’s Nunchaku can be Critical Bleeds, multiplying their Potency by his Critical Damage Multiplier. The chance for a Critical Bleed is equal to his Critical chance.\n- The chance for Critical Bleeds to occur is further increased for every 3 Critical Hits landed in a row during Assassin’s Cunning.\n\n\nPrimal Rage – Passive\n- Ignore the Opponent’s Armor and Resistances.\n- Gain a 100% chance to Purify one of each Stun and Damage over Time Debuff on Hit-Monkey when one is gained, or when Primal Rage activates. Purifying removes Primal Rage.\n- Light hits have a 20% chance to Disorient the Opponent, decreasing their Block Proficiency and Defensive Ability Accuracy by 40% for 6 second(s). The chance to Disorient is increased by 2.50% flat for each Hit landed during Primal Rage, up to 45% total.\n- Special Attack hits have the same chance to Disorient, for 3 additional second(s)."
    },
    "specials": {
        "1": {
            "description": "Monkey Business \nAh ah, ooh ah ooh. Ooh ooh ahh, oh eek! - He says shotguns are more effective when you use your feet.\n\n- If Assassin’s Cunning is active, this attack has Vigilance and cannot Miss.\n- If Primal Rage is active, this attack is Unblockable.\n- If this attack causes a Miss to fail or it breaks through a Block, refresh Assassin’s Cunning and Primal Rage, and Hit-Monkey gains Vigilance and Unblockable until Assassin’s Cunning or Primal Rage expires.",
            "note": "The goal of this Special Attack is to punish your Opponent for trying to block your attacks or cause them to Miss. Doing this successfully will give you a massive advantage for the remainder of your current combat mode. It’s important to note that successfully punishing the Opponent will always grant you both benefits, so (for example) breaking their block will also grant you Vigilance, even if you weren’t in Assassin’s Cunning to begin with."
        },
        "2": {
            "description": "Barrels of Monkey \nOoh ahh ah ah, ook ooh ah ooh. Ook ah! Ook eek oh ohh. - When one gun isn’t enough, diversify! It really catches people off guard.\n\n- If activated immediately after Hit-Monkey lands a Critical Hit, all hits in this attack are guaranteed to be Critical.\n- Assassin’s Cunning and Primal Rage are paused during this attack.",
            "note": "Activating this Special after any of Hit-Monkey’s Guaranteed Critical Hits is an easy way to make the whole Special Attack be Critical. Since there are 7 hits in this attack, doing so means that you’ll trigger lots of Bleeds from Hit-Monkey’s Passive, as well as the benefits from his current combat mode."
        },
        "3": {
            "description": "Macaque Massacre \nAh ah, ook ook ah oh. Ooh eek eeek, ah aack! Ahh ahh eek ooh oh ah! - Uh, this one’s hard to translate. Basically, ‘cool monkeys don’t look at explosions.’\n\n\n- Gain a Cruelty Buff for 27 second(s), increasing Critical Damage Rating by +1130.77.\n- While this Cruelty is active, striking the Opponent pauses Assassin’s Cunning and Primal Rage for 0.30 second(s).",
            "note": "This Special is most useful in longer fights, where you want to spend longer amounts of time in your combat modes. And of course, the Cruelty is nice for all of his Guaranteed Crits."
        }
    },
    "signature": {
        "description": "The Monkey, The Myth, The Legend\n\nPassive  \n- While the Opponent is above or at 25% Health or is a #Mercenary, Assassin’s Cunning and Primal Rage last 3.5 second(s) longer.\n- While the Opponent is below 25% Health or is a #Mercenary, Hit-Monkey Passively reduces their Defensive Ability Accuracy by 40%.",
        "note": "At the beginning of the fight, this Signature Ability is great for spending more time in your mode of choice. Then when the Opponent is on their last legs, Hit-Monkey amps up the intensity by significantly reducing the chance for them to trigger their defensive abilities. This also combines nicely with the Disorient from Primal Rage."
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "https://playcontestofchampions.com/champion-spotlight-hit-monkey/"
    }
}