{
    "description": "Longshot is an Action Hero from the Mojoverse who was genetically enhanced by Arize with super human traits and the powers of Probability Manipulation. Arize made it so the strength of Longshot’s Power was based on the purity of his heart, making him a star candidate for inciting a civil war to overthrow the tyrannical reign of Mojo himself.",
    "gameplay": {
        "description": "Passive:  \n- Due to Longshot’s innate luck his Ability Accuracy can only be reduced through the effects of Debuffs.\n- Longshot’s base Ability Accuracy is 300%. Modified chances are already displayed for Longshot’s abilities.\n\n\nGood Karma – Max 5:\n- Longshot cannot gain Good karma while under the effects of Stun.\n- 51% Chance to gain 1 Good karma when attacked. Increased to 102% if the attack was Dodged.\n- 75% Chance to lose 1 Good karma whenever inflicted with a Non-Damaging Debuff or Struck while Stunned. If the Opponent has Bad Karma active, remove 1 Bad Karma instead.\n- Whenever reaching 5 stacks of Good karma, gain Pure of Heart for 14 seconds. Granting bonus effects from Special Attacks. This effect does not stack, but can be refreshed.\n- When Pure of Heart ends all remaining Good Karma is applied to the opponent as Bad Karma.\n\n\nBad Karma – Max 5:\n- When consuming Good Karma while the Opponent is below max stacks of Bad Karma, apply a Bad Karma on the opponent for 12 seconds and refresh all existing stacks.\n- For each Bad Karma, Longshot gains 12% of Power generated by the opponent.\n- Whenever the Opponent launches a Special Attack or a Heavy Attack all Bad Karma effects are refreshed."
    },
    "attack": {
        "heavy": "While Charging a Heavy Attack gain 1 Good Karma every 0.40 seconds. Each hit consumes 1 Good Karma."
    },
    "specials": {
        "1": {
            "description": "Final Cut\n- Consume 2 Good Karma\n- This attack cannot Miss or be Auto-Blocked.\n- Pure of Heart is active: The first hit inflicts 7 Instant Bleeds, each dealing 459.2 damage. This damage benefits from Longshot’s Critical Damage multiplier.",
            "note": "Developer Notes: If the Opponent is Incinerate Immune, Longshot can loop Special 1 Attacks for big damage. Keeping 5 stacks of Bad Karma on the Opponent at all times will make it easy to build power and repeatedly launch this attack."
        },
        "2": {
            "description": "Workers Compensation\n- The final hit inflicts Incinerate dealing 172.2 damage over 12 seconds. Incinerate also removes Perfect Block chance and lowers Block Proficiency by 50%\n- While this Incinerate is active the Opponent is Fate Sealed, Nullifying all buffs. This Fate Seal also removes Bad Karma effects.\n- Each Buff and Bad Karma removed by Fate Seal combusts and inflicts Passive Incinerates dealing 1033.2 energy damage over 1 second(s). This damage benefits from Longshot’s Critical Damage Rating. Max 10 stacks.\n- Pure of Heart is active: Instead of inflicting incinerate on the Final hit, the Incinerate triggers on activation of this Attack with it’s expiry paused until the Attack ends.",
            "note": "Developer Notes: If the Opponent can prevent the Incinerate from activating, or remove it after it has been activated, the Fate Seal will also be removed."
        },
        "3": {
            "description": "Comedy of Errors\n- Stun the Opponent for 3.50 seconds.\n- Pure of Heart is active: This attack gains up to 1148 Attack Rating based on Longshot’s Good Karma."
        }
    },
    "signature": {
        "description": "Fortune Favors the Lucky\n- 48% Chance to Nullify any Buff and replace it with Bad Karma.\n- If Longshot Nullifies a True Strike, Unstoppable, or Unblockable Buff, Longshot gains a matching Buff for 5.60 seconds.",
        "note": "Developer Notes: Longshot’s Signature Ability also grants him these matching Buffs if his Fate Seal is what Nullifies the Buff. If you’re having troubles with Buff Toggle Unstoppable or Buff Toggle Unblockable, this is a great answer."
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "https://playcontestofchampions.com/champion-spotlight-longshot/"
    },
    "youtube": "-GokpdQhYNU"
}