{
    "description": "Socially shunned for his dwarfish appearance and expelled from his academic roots in nuclear engineering for his Hollow Earth theories, Harvey Rupert Elder stumbles upon the Monster Isle and falls deep into the realm of Subterranea, becoming blinded before the Valley of Diamonds. After this discovery, Elder dubs himself the Mole Man, ruler of Subterranea and the caverns of Monster Isle. Riding on the back of his most trusted monster friend, Giganto Jr., the Mole Man burrows his way into the Contest.",
    "gameplay": {
        "description": "Passive  \n- Shock Immunity: Giganto Jr’s tough monster hide does not conduct electricity granting immunity to Shock effects.\n- While Frenzy is not active and Mole Man is below 5 Monster Mass, Mole Man’s heightened senses allow him to predict his opponent’s movements granting him True Accuracy, ignoring all Evade and Auto-Block effects.\n\n\nCritical Hits \n- 100% chance to inflict a Bleed Debuff dealing 879.75 damage over 8 seconds.\n- Deal 938.4 as a burst of Energy Damage if the opponent is suffering from a Shock Debuff.\n\n\nMonster Mass – Passive \n- 100% chance to gain a Monster Mass when inflicted with a Debuff. This has -70% chance when fighting Mutant Champions. Max 15 Stacks. Debuffs are Purified 1 second(s) after. At 5 Monster Mass or above, this time is decreased to 0.5 second(s).\n- Each Monster Mass grants +370.59 Physical Resistance.\n- Blocking Basic Attacks grants an Unstoppable Buff for 0.85 seconds, allowing for an immediate counter-attack. Well-Timed Blocks do not trigger this Unstoppable Buff. This ability removes 1 Monster Mass.\n- Gain a 75% chance to Resist a Block Break while at least 1 Monster Mass is active. Adding points into the Stand Your Ground Mastery also increases this chance. If the chance to Resist a Block Break is raised to 100%, this ability also Resists Unblockable hits. Resisting an Unblockable or a Block Break removes all Monster Mass.\n- Gain a Monster Mass if a Debuff fails to apply due to an Immunity.\n\n\nFrenzy \n- When above 5 Monster Mass, activating an Unstoppable effect activates Frenzy, allowing all hits to be guaranteed Critical Hits. Frenzy also activates when reaching Max Monster Mass.\n- During Frenzy Monster Mass cannot be removed but each Mass expires after 1.20 second(s) and Debuffs can no longer be Purified.\n- After Monster Mass falls to zero, Mole Man cannot be Frenzied for 15 seconds."
    },
    "attack": {
        "heavy": "Gain 1 Monster Mass. If Frenzied: This attack has up to +1759.5 Attack Rating based on missing Health."
    },
    "specials": {
        "1": {
            "description": "Monster Prod Strike – Mole Man ‘assists’ Giganto Jr. for a shockingly powerful strike. \n- Gain 2 Monster Mass.\n- Inflicts a Shock Debuff dealing 1642.2 damage over 14 seconds.",
            "note": "Gaining Monster Mass while Frenzied is possible using Heavy Attacks, Special 1, and Special 3. This will force Mole Man to be in Frenzy for longer."
        },
        "2": {
            "description": "Holey Moley Bojutsu – Mole Man goes high in a flurry of bo staff strikes and Giganto Jr. goes low for a surprise subterranean blow.  \n- Each hit has +525 Critical Damage Rating.\n- This attack gains up to +1759.5 Attack Rating based on missing Health.\n- If Frenzied: This attack pauses Unstoppable Buffs and is Unblockable.",
            "note": "While Frenzied, each hit of this Special Attack will be a Critical Hit. Use this in tandem with Frenzy to deal even more bonus damage. This damage is heightened even more when Mole Man is at max Signature."
        },
        "3": {
            "description": "Subterranean Frenzy – With monster Adrenaline flowing through Giganto Jr. ‘s veins, Giganto Jr. shows his opponents the full ferocity of Monster Isle. \n- Gain 10 Monster Mass and become Frenzied if not on Cooldown."
        }
    },
    "signature": {
        "description": "Giganto Jr.’s Revenge \nPassive \n- Gain up to 2566.66 Critical Damage Rating based on missing Health.\n- Gain up to 2346.01 Attack Rating while Unstoppable based on missing Health."
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "https://playcontestofchampions.com/champion-spotlight-mole-man/"
    },
    "youtube": "v8ZRVqC8zrU"
}
