{
    "youtube": "BBGWuLN-jGg",
    "description": "Reed Richards is a brilliant scientist, who spearheaded an experimental voyage into space accompanied by his friends and family. An accident occurred during the trip, and the ship was flooded with cosmic rays. After crashing back to Earth, Reed found that he could stretch and elongate his body in impossible ways. He became the leader of the Fantastic Four, and uses both his powers of elasticity and his genius intellect to deftly handle all threats, galactic to microscopic.",
    "gameplay": {
        "description": "Passive  \n- Physical and Energy Resistance increased by +857.14.\n- 5% chance to Evade for each non-Damaging Debuff on either Champion. Does not trigger during a Well-Timed Block.\n- Attack Rating is increased by +57.4 for each Debuff on the Opponent.\n\n\nPrepared for Anything – Pre-Fight Ability\n- Before the fight, choose up to 3 unique Debuffs to place on the Opponent at the start of the next fight. Each Debuff costs 1 Persistent Charge.\n- Mister Fantastic starts with 2 Persistent Charge(s), and can have up to 5. When Mr. Fantastic finishes a fight, he gains 1 Persistent Charge for each unique Debuff on the Opponent.\n- These Debuffs each last 12 second(s), and are refreshed when the Opponent is knocked down.\n- The Debuffs are applied even if a different Champion enters the fight.\n- Debuff potency scales with the rarity of Mr. Fantastic. If different versions of a Debuff are applied, only the strongest one triggers.\n\n\nPrepared for Anything – Pre-Fight Debuffs – Max: 3 Each\n- Petrify the Opponent, reducing the effectiveness of their Regeneration and Power Gain effects by 30%.\n- Suppress the Opponent, decreasing their Defensive Power Rate by 19%.\n- Debuff Siphon the Opponent, increasing the potency of Damage over Time Debuffs on them by 19%, and reducing the potency of those effects on allies by the same amount. This does not affect abilities that trigger at the start of the fight.\n\n\nOpponent activates a Special Attack\n- When the Opponent activates a Special Attack, place an indefinite Careful Study Debuff on them for that Special Attack.\n- A Careful Study Debuff lowers the Attack Rating of each Hit in the Special Attack by 25%.\n- If Mister Fantastic was struck by the last hit of the Special Attack, place 1 additional copy of the Debuff.\n- All copies of the Debuff are Purified when the Opponent activates a different Special Attack than the one that triggered the Debuff.\n\n\nCareful Study – Cross-Fight Ability\n- When the Opponent has 3 copies of a Careful Study Debuff, they are combined into a Passive that lasts for the rest of the fight, and the next 5 fights the Opponent participates in.\n- Careful Study Passives count as 3 Debuffs for Reed’s other abilities.\n- Each Passive prevents future matching Careful Study Debuffs.\n\n\nSpecial Attacks\n- If no Pre-Fight Debuffs were selected, Special Attacks are Unblockable."
    },
    "attack": {
        "heavy": "On the last hit, pause Pre-Fight Debuffs for 3 second(s).",
        "note": "Heavy Attacks also refresh Pre-Fight Debuffs, because they knock the Opponent down. The pause will take effect after the Debuff is refreshed, so they’ll be paused at their full duration."
    },
    "specials": {
        "1": {
            "description": "Aggressive Hypothesis\n- When this Attack is activated, 100% chance to place a Taunt Debuff and Stagger Debuff on the Opponent, each for 9 second(s).\n- Opponents that are Taunted have their Attack Rating reduced by 40% and have a 70% higher chance to activate a Special Attack.\n- This Taunt is removed when the Opponent activates any Special Attack.\n- The next time a Staggered Opponent triggers a Buff, that Buff and all other Buffs triggered at the same time will be immediately Nullified.",
            "note": "The goal for this ability was to give Mister Fantastic an easy way to Taunt the Opponent. When the Taunt is triggered at the right time, the Opponent will be more likely to throw the Special Attack that maintains their current Careful Study Debuffs."
        },
        "2": {
            "description": "Rigorous Experimentation\n- When this Attack is activated, re-trigger Mister Fantastic’s selected Pre-Fight Debuffs once each.\n- The last hit Shocks the Opponent, dealing 688.8 Energy Damage over 5 second(s).",
            "note": "While his allies need to keep knocking down the Opponent to maintain Pre-Fight Debuffs, Mister Fantastic is able to easily re-trigger them using his SP2. Also, if the Pre-Fight Debuffs are already active when he uses it, he’ll simply put another copy of them onto the Opponent (to a maximum of 3 each). The Shock on this attack also works nicely with his Debuff Siphon Debuff."
        },
        "3": {
            "description": "Thinking with Portals\n- If the Opponent has at least 1 Debuff, gain a Passive Fury for 20 second(s), increasing Attack Rating by 229.6 for each Debuff on the Opponent.",
            "note": "Here’s the big payoff for building up all those Debuffs. If you’re able to get all 3 different Careful Study Passives on the Opponent, and stack up 3 of each Pre-Fight Debuff, and Stun the Opponent with Parry, you’ll have a total of 19 Debuffs on the Opponent multiplied into this Fury Passive."
        }
    },
    "signature": {
        "description": "The Smartest Man in the Battlerealm\n\nAll Attacks\n- Mister Fantastic’s Offensive Power Rate is increased by 40% for each Careful Study Passive on the Opponent.\n- Mister Fantastic gains an additional flat 20% chance to Evade any Unblockable attack. This increases by 3% every time the Opponent starts an Unblockable hit, capped at 50% for basic attacks.",
        "note": "Mister Fantastic’s Signature Ability is relatively cut and dry, especially in comparison to his other abilities. Mister Fantastic already wants to build Careful Study Passives on the Opponent. Increasing his Offensive Power Rate as he builds them will let him use his SP1 more frequently to increase the uptime on his Taunt, and it can even allow him to use his SP2 while the Fury from his SP3 is active. Increasing his Evade chance against Unblockable attacks is also very nice to have against certain Opponents. The chance increases occurs as soon as the Opponent starts the hit, so it’ll go up even if Mister Fantastic avoids the Unblockable hit."
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "https://playcontestofchampions.com/champion-spotlight-mister-fantastic/"
    }
}