{
    "attack": {
        "description": "Medium Attacks:\n30% chance to inflict Bleed dealing 347.7 Direct Damage over 6 seconds.",
        "heavy": "While IMPERIUS REX is active, launching a Heavy Attack consumes 15 stacks of Outrage and generates 100% of a bar of Power."
    },
    "gameplay": {
        "description": "Outrage: \n- Namor can have a maximum of 30 stacks of Outrage.\n- Every 3 seconds Namor gains 1 Outrage. Each time Namor is affected by a Stun Debuff, he reduces the time between each Outrage generated by 0.50 seconds. Once Namor activates IMPERIUS REX the timer is reset back to 3 seconds.\n- Namor gains 1 Outrage whenever he is affected by a Bleed or Incinerate Debuff\n- Namor gains 1 Outrage whenever he fails to apply a Bleed or Stun Debuff to the Opponent, or whenever the Opponent Purifies a Debuff.\n- Namor does not generate Outrage when failing to apply Bleed Debuffs to Robots. He does not hold them responsible for their lack of blood.  \n\n\nIMPERIUS REX:\n- If Namor has 15 stacks of Outrage he can Dash Back and hold Block for 1.2 seconds to instantly gain 1 bar of Power and activate IMPERIUS REX\n- If Namor has 30 stacks of Outrage he instantly generates up to 95% of his Max Power and activates IMPERIUS REX\n- Namor's Special Attacks deal up to 240% additional damage based on active stacks of Outrage.\n- Special Attacks cost 90% less Power. However, Namor Drains 15% of a bar of Power every second. Each Special Attack Namor launches applies an additional Drain of 5% per second.\n- While Imperious Rex is active Namor cannot gain Power from any sources other than his own abilities.\n- Once Namor has 0 Power remaining, all stacks of outrage are removed and IMPERIUS REX ends.\n\n\nSPECIAL ATTACKS\n- Namor Regenerates 6% of his missing health."
    },
    "specials": {
        "1": {
            "description": "To the Point\nNamor propels himself and his trident forward in a violent whirlpool of waves, destroying everything in his path.\n\n\n- Each hit has a 50% chance to inflict a Bleed dealing 1159 Direct Damage over 8 seconds.\n- While IMPERIUS REX is active, Namor generates twice as much Outrage from all sources for the duration of this Special Attack.",
            "note": "This attack has 5 hits, each one with a chance of failing a bleed, making it Namor’s bread and butter combo ender. Since IMPERIUS REX generates so much Power for him, the number one priority should be building Outrage as quickly as possible."
        },
        "2": {
            "description": "Slam Dunk\nNamor leaps into the air then lobs his Trident into the Earth, creating an explosive geyser of water before landing a final devastating blow on his bewildered Opponent.\n\n- Each hit has a 50% chance to inflict Stun lasting 2.50 seconds.\n- While IMPERIUS REX is active this attack is Unblockable.",
            "note": "This is a 3 hit Special Attack best used during IMPERIOUS REX. An Unblockable Stun makes connecting any other Special Attacks within IMPERIUS REX way easier to achieve. However, the duration of the Stun is set up in a way that you can only combo off of this attack if the Stun occurred on the final hit. With the right Mastery set up it is possible to extend the duration of the Stun so Namor can land a combo if the Stun occurred on the second hit."
        },
        "3": {
            "description": "Might of Neptune\nNamor unleashes the full power of Neptune’s Trident, summoning an ocean in places where oceans do not belong.\n\n- Gain Fury increasing Attack Rating by 3477 for 20 seconds. While this Fury is active, Namor’s Opponents gain 0 Power when struck by Special Attacks.",
            "note": "The Special 3 is best used directly after initiating IMPERIUS REX to ensure Namor’s Opponents don’t receive any power when struck by his future Special Attacks. Skilled Namor players will be able to use the Power gained from Heavy Attacks to launch multiple Special 3’s back to back."
        }
    },
    "signature": {
        "description": "Hydrokinetic Armor\nNamor uses his Hydrokinetic powers to protect his strikes from opponents who deal damage when struck by the Sub-Mariner\n\n- Namor takes 100% reduced damage from all sources while attacking his Opponent. When Namor ends an Attack, any damage prevented by Hydrokinetic Armor is captured and set back to the Opponent as Energy Damage.",
        "note": "Any damage received between the beginning and end of Namors attacks are instead dealt back to his Opponent. The original target of this ability was Thorns characters such as Korg and Killmonger. However, it’s usefulness does extend to things such as suicide masteries or any damage over time effects Namor is suffering from."
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "https://forums.playcontestofchampions.com/en/discussion/142291/champion-spotlight-namor"
    },
    "description": "To both heroes and villains alike, Namor has been a mighty ally and a formidable foe. The short-tempered Mutant King of Atlantis will stop at nothing to crush anyone and anything that threatens his Kingdom and its people. No matter who you are or what your intentions may have been."
}