{
    "description": "It was during the peak of the Cold War that saw the Soviets transform Arkady Rossovich into the super soldier Omega Red. Wielding nearly indestructible tentacles and a Death Factor capable of killing by mere proximity, Omega Red was terrifyingly beyond their control. His creators sealed him away in cryogenic stasis where he remained until present day, when he was awoken by criminal organization The Hand to do battle with Wolverine and the X-Men.",
    "youtube": "TBvU2w5zy1k",
    "gameplay": {
        "description": "Passive \nOmega Red’s mutant physiology renders him immune to the effects of Poisons and reduces the damage of Bleeds by 90%.\nTentacles Hits reduce 100% of damage inflicted by enemy abilities that deal passive damage when they are struck.\nDeveloper Note: The Tentacles reduce damage received from On-Struck defensive abilities and will put a stop to the damage from Killmonger’s Reverberation and Korg’s Rock Hard Thorns\n\nDeath Factor \nWhile near the opponent, Omega Red inflicts 1 Death Spore every .5 second(s) up to a maximum of 10. Once the opponent is out of range they lose 1 Death Spore every .15 second(s). Death Spores are not affected by Ability Accuracy reduction.\nEach Death Spore lowers the opponent’s Armor Rating by 105 and reduces their chance to Purify debuffs by 10%.\nDeath Spores struggle to effect mechanical components and are inflicted 4 times slower against Robots.\nDeveloper Note: When playing as Omega Red, managing your proximity will be essential, more Death Spores mean more damage and less chance those pesky Skill Champions will Purify your Stuns from a Parry. Additionally his most important abilities are unaffected by Ability Accuracy reduction, making him a bit more reliable in some matchups.\n\nDeath Field \nWhile Omega Red is Bleeding, he emits the Death Field.\nThe Death Field causes Death Spores on nearby opponents to Passively Degenerate them, dealing 43 damage per second for each Death Spore on them. The Death Field is not affected by Ability Accuracy reduction.\nWhile the Death Field is active, the limit for Death Spores on the opponent increases to 30.\nDeveloper Note: Omega Red will brutally punish any Champion brave enough to inflict Bleed, what runs through Omega’s veins should stay in there."
    },
    "attack": {
        "heavy": "Inflicts a Degeneration Debuff for 7 second(s), dealing 182 damage for each Death Spore on the opponent. Death Spores do not expire while the opponent is out of range of the Death Factor for as long as they have an active Degeneration Debuff.",
        "note": "The Degeneration Debuff does not stack and will need to expire before the next can be applied, but careful timing will allow a player to keep the Death Spores locked on the opponent at all times."
    },
    "specials": {
        "1": {
            "description": "Draining Experience – Omega Red uses his Carbonadium tentacles to take life force through brute force.",
            "note": "Removes all Death Spores from the opponent to inflict Life Steal, Stealing 98 Health from the opponent for each Death Spore removed by this attack."
        },
        "2": {
            "description": "Death Field – Flooding the air around him with deadly spores, Omega Red makes any proximity problematic.",
            "note": "Omega Red emits the Death Field for 10 seconds. Developer Note: Using the Death Field to build up Death Spores will help Omega Red reach the maximum potential of other abilities."
        },
        "3": {
            "description": "Tentacled Terror – Wild arcs of tentacles send the opponent helplessly into the air and down again as Omega Red prepares a final attack to leave his opponent completely drained.",
            "note": "Removes all Death Spores from the opponent to inflict Essence Steal for 3 second(s), Passively Stealing both 170 Health and 3.3% of Current Power from the opponent for each Death Spore removed by this attack."
        }
    },
    "signature": {
        "description": "Lethal Dose – When the opponent builds up enough Death Spores they begin to lose health and the strength needed to block Omega Red’s assault.\n\nPassive – Opponent has 10 or more Death Spores \nDeath Spores on the opponent deal 120~973 damage per second.\nOmega Red’s Basic Tentacle Hits have a 10~30% chance to be Unblockable.",
        "note": "Players can use the Heavy Attack to lock the opponent with the Lethal Dose, keeping the passive damage ticking even while Omega Red is out-of-range or playing defensively. Additionally, once the opponent has a Lethal Dose, players using Omega Red should look to punch through the enemy Block with his tentacled Medium Attacks."
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "https://playcontestofchampions.com/champion-spotlight-omega-red/"
    }
}