{
    "description": "The Red Skull has managed to orchestrate the assassinations of his enemies, manipulate his way to power, and lead HYDRA in a plan to devastate the world's most influential countries. Using his scientific talents and knowledge of the occult to research what others considered only a myth: the Cosmic Cube. Now armed with knowledge of its deepest secrets, The Red Skull has been able to harness it to power his suit of Hydra armor.",
    "gameplay": {
        "description": "Overwhelming Presence – Passive  \nRed Skull and the Cosmic Cube emit a presence that opponents find challenging to overcome. This greatly boosts Red Skull’s chances to trigger abilities and provides passive bonuses.\nGain +105.26 Critical Resistance and +105.26 Energy Resistance for each Buff on Red Skull.\nThe opponent’s Power Rate is reduced by 10% for each Debuff on them.\n\nFight Start \nGain 5 Armor Up Buffs, each increasing Armor Rating by 222.22. Armor Up Buffs stack up to 10.\n\nAfter filling a bar of Power \nGain an Armor Up Buff.\n\nBlocking a Basic Attack \nConsume one Armor Up Buff generated by Red Skull to Power Drain 10% of the opponent’s Max Power and inflict 114.8 as Direct Damage for each Buff on Red Skull."
    },
    "specials": {
        "1": {
            "description": "Transmit Force – Red Skull strikes his opponent before passing through space to quickly catch them off guard with two quick hits.",
            "note": "The final hit refreshes all Shocks on the opponent inflicted through Red Skull’s abilities and Stuns the opponent for 2 seconds."
        },
        "2": {
            "description": "Harness Power – Manipulating the power of the Cosmic Cube, Red Skull unleashes multiple projectile attacks.",
            "note": "Each hit Shocks the opponent, dealing 258.3 Energy damage over 2.5 seconds. Shock duration is increased by 50% for each Buff on Red Skull. These Shock Debuffs stack up to 5."
        },
        "3": {
            "description": "Kneel Before Me! – The opponent is helpless in the presence of such raw power. Red Skull bends them to his will before unleashing the full force of the Cosmic Cube upon them.",
            "note": "Drain all of the opponent’s Power. For every 10% of Power drained this way, gain an Armor Up Buff."
        }
    },
    "attack": {
        "heavy": "If the opponent is Stunned, Heal Block them for 7.5 seconds."
    },
    "signature": {
        "description": "Cube Affinity – The Cosmic Cube aligns its ambition with Red Skull, providing him additional power when utilized.",
        "note": "While Heavy Charging, generate 6% Power per second and Heavy Charging can be held for an extended duration. Landing a Heavy Attack when the opponent Dashes in, Shocks the opponent, dealing 2296 Energy damage over 2 seconds."
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "https://playcontestofchampions.com/champion-spotlight-red-skull/"
    },
    "youtube": "QgXw-giRH4E"
}