{
    "description": "Tyros once reigned over the city of Lanlak on the planet of Birj. Galactus saw the brutal dictator’s potential and made him his own Herald of Galactus. With Terrax’s command over rock and earth now magnified and the Power Cosmic on his side, “Terrax the Tamer” became Galactus’ most ruthless conqueror.",
    "gameplay": {
        "description": "Geokinesis \n- Terrax is immune to Shock and Bleed effects due to his rocky body.\n- Terrax is immune to Power Drain, Power Steal, Power Burn, Power Lock, and Enervate effects from Metal Champions due to his control over rock and earth.\n\n\nPower Cosmic – Persistent Charge – Max 6 Stacks\n- Terrax gains 1 Attack Charge(s) whenever he attacks the Opponent and 2 Attack Charge(s) whenever the Opponent attacks him. Terrax gains 10 Attack Charge(s) whenever his attack misses the Opponent. Terrax gains 1 Attack Charge(s) every 0.5 seconds while the Opponent is inside his Rock Field.\n- When Terrax gains 50 Attack Charges he converts them into 1 Power Cosmic. Max 2 per fight.\n- For each Power Cosmic, Terrax gains an additional +10% Power Rate when struck while Indestructible. Max +60%.\n- For each Power Cosmic, Terrax gains an additional +110% Power Rate when blocking an attack while Indestructible. Max +660%.\n- When Terrax starts a Rock Field, he gains 1 Indestructible Charge Buff for each Power Cosmic. 1 Indestructible Charge is removed each time Terrax is attacked. All remaining Indestructible Charges are removed when the Rock Field expires. Max 10 Indestructible Charges.\n- Terrax’s Indestructible Charge Buffs only ignore damage from attacks and do not ignore damage from Special 3 Attacks.\n\n\nRock Field\n- While the Rock Field is active, Terrax’s attacks gain an additional 1779.9 Attack Rating.\n- While the Rock Field is active, nearby Opponents take up to 523.5 Energy Damage for every second the Rock Field has been active, every 0.5 second(s). This scales with Base Attack only.\n- Every 0.5 second(s) there is a 20% chance to inflict an Armor Break Debuff, reducing the Opponent’s Armor Rating by 83.33 for 8 second(s). Max 10 stacks.\n- While the Rock Field is active, Terrax is more aggressive.\n\n\nSpecial Attacks\n- Special Attacks cost 100% less power, but after each Special Attack, Terrax’s Power Bar drains until he reaches 0 Power. During this time, Terrax cannot use Special Attacks and his Rock Field is active.\n- Terrax loses power faster the longer his Rock Field has been active."
    },
    "attack": {
        "description": "Terrax’s fourth Light Attack refreshes the duration of all personal Armor Break Debuffs on the Opponent.",
        "heavy": "The Rock Field Power Drain is paused while Terrax is charging his Heavy Attack. If the Rock Field is active, this attack is a guaranteed Critical Hit, Terrax does not gain Power from this attack, but he gains up to 5235 increased Attack Rating based on how long the Rock Field was active. On hit, the Rock Field ends and consumes 100% of a bar of Power."
    },
    "specials": {
        "1": {
            "description": "Rock Torrent\n- If Terrax has less than 6 Power Cosmic, he gains 20 Attack Charges.\n- If Terrax has 6+ Power Cosmic, he gains 3 Indestructible Charge(s) until the Rock Field expires after this Special Attack.\n- The Rock Field triggered after this Special Attack has a flat +40% increased chance to Armor Break the Opponent.",
            "note": "Although the Rock Field after this Special Attack, is quite short, it speeds up Terrax’s Power Cosmic ramp and when he’s fully ramped, it gives him more Indestructible Charges!"
        },
        "2": {
            "description": "Meteor Strike\n- The last hit grants Terrax a Power Gain Buff, generating 40% of his Max Power over 12 seconds. Max 1.",
            "note": "Since Terrax’s Power Meter is draining after each Special Attack, this Power Gain Buff will slow down the process, allowing for an even longer Rock Field."
        },
        "3": {
            "description": "Buried Alive\n- Inflict a Stun Debuff, lasting 2 second(s).\n- Inflict an Armor Break Debuff, reducing the Opponent’s Armor Rating by 857.14 for 15 second(s). Max 1.",
            "note": "This Armor Break can be refreshed with Terrax’s fourth Light Attack, allowing him to potentially keep it up the entire fight."
        }
    },
    "signature": {
        "description": "Galactus’ Favor\n- If Terrax has less than 1 Power Cosmic at the start of a fight, he gains 2.\n- Terrax starts each fight with his Rock Field active and 66% of his max Power."
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "https://playcontestofchampions.com/champion-spotlight-terrax/"
    },
    "youtube": "F4vxpTfJSG8"
}
