{
    "description": "As an Elders of the Universe member, The Champion is able to control an energy source referred to as the Power Primordial, the residual energy that is left over from the Big Bang itself. He channels this energy to enhance his physical form, and he seeks out the greatest fighters in the universe to test the limits of his powers.",
    "gameplay": {
        "description": "Persistent Charge \nThe Champion channels The Power Primordial, the residual energy left over from the Big Bang, to enhance his physical form and gain up to 5 Persistent Charges.\nEvery 13 seconds, The Champion gains 1 Persistent Charge and activates Fury Buffs equal to his Persistent Charge, each granting him +545 Attack Rating for 4.2 seconds.\n1 Persistent Charge(s) are lost for every 20 hits in the opponent’s Combo Meter and when one of his Fury Buffs is Nullified by the opponent.\n\nChampion of the Universe \nThe Champion always seeks to fight against the Greatest Fighters in the universe. While fighting them, he gains Persistent Charges 28% faster and increases the Duration and Ability Accuracy of all of his Buffs by a flat +25%.\nContest’s Greatest Fighters: Star-Lord, Spider-Man (Stark Enhanced), Corvus Glaive, Hyperion, Iceman, Archangel, Blade, Gwenpool, Void, Hulk (Ragnarok), Magik, Ghost Rider.\n\nWhile attacking or defending the final node in a Quest +666 Armor and Block Penetration.",
        "note": "This is a piece of his lore that we really wanted to incorporate in his ability design. The Champion is all about travelling through the universe in search for a good fight against the greatest fighters of the universe, mostly to show off his skills. This list includes two Champions of each Class. The Champion will be a great option on AvA attack and on defense when fighting against champions on his list."
    },
    "attack": {
        "description": "Light Attacks – Requires 2 Persistent Charges\nActivates True Accuracy for 7 seconds if intercepting the opponent’s Dash Attack, allowing him to ignore Auto Block and all Evade effects.\n\nMedium Attacks – Requires 3 Persistent Charges Inflicts an Armor Break if intercepting the opponent’s Dash Attack, reducing Armor Rating by 857 for 6 seconds."
    },
    "specials": {
        "1": {
            "description": "Judo Chop – The Champion paralyzes the opponent with a knife-hand-chop combo then finishes them with a powerful skullet hit.",
            "note": "When The Champion has 4 or more Persistent Charges, he spends one to activate a Regeneration Buff, regenerating 693 Health over 3 seconds."
        },
        "2": {
            "description": "Missile Dropkick – The Champion channels the Power Primordial into his legs to unleash a flurry of powered-up kicks, inflicting critical blows onto the opponent.",
            "note": "Spends 2 Persistent Charge(s) if hitting the opponent, granting 8000 Critical Rating for this attack."
        },
        "3": {
            "description": "Champion’s Press Backbreaker – The Champion strikes the opponent with a flurry of combos powered up by the Power Primordial, finishing them with a decisive blow to their back.",
            "note": "Spends 2 Persistent Charge) to activate a Fury Buff, granting +198 Attack Rating for 10 seconds. This Fury counts towards The Champion’s Primal Fury Signature Ability."
        }
    },
    "signature": {
        "description": "Primal Fury \nWhen at least one of his Fury Buffs is active, The Champion unleashes the full potential of The Power Primordial. This increases the Potency of his Armor Break by 150%. Additionally, when he activates 2 or more of his Fury Buffs, he becomes Unstoppable, shrugging off the impact of the opponent’s Basic Attacks for 5 seconds.\nWhile attacking or defending on the final node in a Quest, for each active Fury Buff and while his Unstoppable Buff is active, he regenerates 1.7% of the damage taken this fight per second, excluding the amount already regenerated by this ability. This ability can regenerate up to a maximum of 5% Health per second.\nIn addition to regenerating Health, The Champion is immune to Fate Seal, Heal Block, Petrify, and any effects that modify Regeneration other than Poison.",
        "note": "That was long! Basically, When he activates his Fury Buff cycle, he can activate Unstoppable Buff and a very strong Regeneration passive. 1.7% per Fury means he will be able Regenerate 8.5% of the damage he took in the current fight, per second. (1.7% * 5 Fury Buffs from his Persistent Charge)"
    },
    "youtube": "11dTDVsujTc"
}